## Joining Datasets

In [6]:
import pandas as pd

### using concat

In [7]:
df1 = pd.DataFrame({'A': [1, 2], 'B': [2, 4]})
df1

   A  B
0  1  2
1  2  4

In [8]:
df2 = pd.DataFrame({'C': [5, 6], 'D': [7, 8]})
df2

   C  D
0  5  7
1  6  8

In [10]:
df3 = pd.concat([df1, df2], axis=0) #along rows
df3

     A    B    C    D
0  1.0  2.0  NaN  NaN
1  2.0  4.0  NaN  NaN
0  NaN  NaN  5.0  7.0
1  NaN  NaN  6.0  8.0

In [11]:
pd.concat([df1, df2], axis=1) #along columns

   A  B  C  D
0  1  2  5  7
1  2  4  6  8

## using append: this is a depreciated feature. Currently unavailable in newer versions of python

In [14]:
df4 = pd.DataFrame({'A': [1, 2,], 'B': [3, 4]})
df5 = pd.DataFrame({'A': [6, 7,], 'B': [7, 8]}) #only joins values under the same name

In [15]:
df4.append(df5)

AttributeError: 'DataFrame' object has no attribute 'append'

## using merge: there must be a common column to merge

In [16]:
df6 = pd.DataFrame({'ID': [1, 2, 3, 4], 'name': ['Jay', 'Grey', 'Ban', 'Gojo']})
df6

   ID  name
0   1   Jay
1   2  Grey
2   3   Ban
3   4  Gojo

In [17]:
df7 = pd.DataFrame({'ID': [2, 3, 4], 'Score': [67, 34, 87]})
df7

   ID  Score
0   2     67
1   3     34
2   4     87

pd.merge(df6, df7, on='ID') # has a default joining method called 'inner'. This returns records present in both common columns.

## using left join: this returns all the records in the left dataframe and corresponding records in the right.

In [22]:
pd.merge(df6, df7, on='ID', how='left') # the first dataframe specified is the left and gives null values to right not present

   ID  name  Score
0   1   Jay    NaN
1   2  Grey   67.0
2   3   Ban   34.0
3   4  Gojo   87.0

In [26]:
pd.merge(df6, df7, on='ID', how='right') # exact opposite of left join

   ID  name  Score
0   2  Grey     67
1   3   Ban     34
2   4  Gojo     87

In [27]:
df8 = pd.DataFrame({"ID": [2,3,6,7], "Grade": ['A', 'B', 'C', 'D']})
df8

   ID Grade
0   2     A
1   3     B
2   6     C
3   7     D

In [28]:
pd.merge(df6, df8, on='ID')

   ID  name Grade
0   2  Grey     A
1   3   Ban     B

In [29]:
pd.merge(df6, df8, on='ID', how='left')

   ID  name Grade
0   1   Jay   NaN
1   2  Grey     A
2   3   Ban     B
3   4  Gojo   NaN

In [30]:
pd.merge(df6, df8, on='ID', how='right')

   ID  name Grade
0   2  Grey     A
1   3   Ban     B
2   6   NaN     C
3   7   NaN     D

In [44]:
df9 = pd.DataFrame({"Student_ID": [2,3,6,7], "Grade": ['A', 'B', 'C', 'D']})
df9

   Student_ID Grade
0           2     A
1           3     B
2           6     C
3           7     D

In [47]:
df10 = pd.merge(df6, df9, left_on='ID', how='right', right_on='Student_ID')
df10

    ID  name  Student_ID Grade
0  2.0  Grey           2     A
1  3.0   Ban           3     B
2  NaN   NaN           6     C
3  NaN   NaN           7     D

In [48]:
df10.drop("Student_ID", axis=1, inplace=True)

In [49]:
df10

    ID  name Grade
0  2.0  Grey     A
1  3.0   Ban     B
2  NaN   NaN     C
3  NaN   NaN     D

### outer join: returns all records on both tables

In [51]:
pd.merge(df7, df9, left_on="ID", right_on="Student_ID", how='outer')

    ID  Score  Student_ID Grade
0  2.0   67.0         2.0     A
1  3.0   34.0         3.0     B
2  4.0   87.0         NaN   NaN
3  NaN    NaN         6.0     C
4  NaN    NaN         7.0     D

### joining on index

In [52]:
df6

   ID  name
0   1   Jay
1   2  Grey
2   3   Ban
3   4  Gojo

In [53]:
df8

   ID Grade
0   2     A
1   3     B
2   6     C
3   7     D

In [60]:
df6.set_index('ID', inplace=True)

KeyError: "None of ['ID'] are in the columns"

In [61]:
df6

    name
ID
1    Jay
2   Grey
3    Ban
4   Gojo

In [62]:
df8

   ID Grade
0   2     A
1   3     B
2   6     C
3   7     D

In [68]:
pd.merge(df6, df8, left_index=True, right_index=True, how='right')

   name  ID Grade
0   NaN   2     A
1   Jay   3     B
2  Grey   6     C
3   Ban   7     D

### using join

In [69]:
df6

    name
ID
1    Jay
2   Grey
3    Ban
4   Gojo

In [70]:
df8

   ID Grade
0   2     A
1   3     B
2   6     C
3   7     D

In [71]:
df6.join(df8)

    name   ID Grade
ID
1    Jay  3.0     B
2   Grey  6.0     C
3    Ban  7.0     D
4   Gojo  NaN   NaN

In [72]:
df8.join(df6) # acts like a left join

   ID Grade  name
0   2     A   NaN
1   3     B   Jay
2   6     C  Grey
3   7     D   Ban